'''
PYTHON Algorithm

입출력---------
\' : 작은따옴표 출력 => '
\" : 큰따옴표 출력 => "
\\ : 역슬래시 출력 => \
c = input() : c라는 변수에 키보드로 입력한 값을 대입
c = int(input()) : 변수 c에 키보드로 입력한 값을 정수로 바꿔서 대입
c = float(input()) : 변수 c에 키보드로 입력한 값을 실수로 바꿔서 대입
a, b = input().split() : 입력된 값을 공백 기준으로 나누어 변수 a, b에 대입
print(c2, c1) : 변수 여러개를 쉼표를 기준으로 공백을 두고 출력
print(s, s, s) :한 줄에 공백을 두고 여러번 출력
input().split(':') : 입력 받은 값을 콜론 기호를 기준으로 자름
print(a, b, sep=':') : 콜론 기호를 사이에 두고 a와 b 출력
for i in range(len(s)):
    print(s[i])
        : s의 글자 수만큼 i번째 글자를 한 줄씩 출력
s[a:b] : s라는 단어에서 a번째 문자부터 b-1번째 문자까지 잘라낸 부분
print('%x' % n) : n을 16진수 소문자 형태 문자열('%x')로 출력
'''